<%@ page language="java" contentType="text/html; charset=utf-8" pageEncoding="utf-8"%>
<!DOCTYPE html>
<html>
<head>
<%@ include file="/include/head.jsp"%>
</head>
<body>
	<div class="auth-wrapper">
		<div class="auth-content">
			<div class="auth-bg">
				<span class="r"></span> <span class="r s"></span> <span class="r s"></span>
				<span class="r"></span>
			</div>
			<div class="card">
				<div class="card-body text-center">
					<h5 class="mb-4">
						<spring:message code='login.agreement' />
					</h5>

					<h6 class="mb-3" style="font-size: 11.5px;">
						<span style="color: red; font-weight: 600;"><spring:message code='login.agmMsg2' /></span>&nbsp;<spring:message code='login.agmMsg3' />
					</h6>

					<div class="input-group mb-3">
						<textarea class="form-control" rows="7" readonly="readonly" style="resize:none;">인터넷 이용약관
제1장 총칙
제1조 (목적)
① djz레퍼런스센터 이용약관(이하 "센터"라 합니다)은 이용자가 센터에서 운영하는 인터넷 홈페이지에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 합니다)를 이용함에 있어 사이트와 이용자의 권리 및 책임사항을 규정함을 목적으로 합니다.

② 이용자가 되고자 하는 자가 "센터"가 정한 소정의 절차를 거쳐서 "동의" 단추를 누르면 이 약관에 동의하는 것으로 간주합니다. 이 약관에 정하는 이외의 이용자와 "센터"의 권리, 의무 및 책임사항에 관해서는 대한민국의 관련 법령과 상관습에 의합니다. 동의를 거부할 수 있으며 이경우 본사이트의 서비스를 받으실 수 없음을 알려드립니다.


제2조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

① 연결사이트 : 홈페이지와 하이퍼링크 방식(하이퍼링크의 대상에는 문자, 정지 및 동화상 등이 포함됨)등으로 연결된 웹 사이트를 말합니다.

② 회원(이용자) : 이 약관에 동의하고, 인터넷 홈페이지에 로그인하여 이 약관에 따라 병원이 제공하는 서비스를 받는 자를 말합니다.

③ 운영자 : 서비스의 전반적인 관리와 원활한 운영을 위하여 병원에서 선정한 사람을 말합니다.

④ 아이디(ID) : 회원이 서비스를 제공받기 위하여 본 사이트로 접속할 수 있는 로그인명을 말하며, 병원에서 승인하는 문자와 숫자의 조합을 말합니다.

⑤ 비밀번호 : 회원이 부여 받은 아이디(ID)와 일치된 회원임을 확인하고 회원 자신의 비밀을 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 말합니다.

⑥ 개인정보 : 당해 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 특정 개인을 식별할 수 있는 정보

(당해 정보만으로는 특정 개인을 인식할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함한다)를 말합니다.
⑦ 해지 : 이용자가 서비스 개통 후 이용계약을 종료시키는 의사표시를 말합니다.


제2장 회원의 가입 및 탈퇴
제6조 (회원가입)
① 이용자는 병원의 정한 양식에 따라 회원정보를 기입한 후 본 약관에 동의한다는 의사표시를 함으로써 회원가입을 신청합니다.

② 회원가입계약의 성립시기는 병원이 승낙(승인)한 시점으로 합니다.

③ 회원은 등록사항에 변경이 있는 경우 인터넷을 통하여 수정하거나 유선으로 병원에 통보하여야 합니다.


제7조 (회원 탈퇴 및 자격의 상실등)
① 회원은 언제든지 탈퇴를 요청할 수 있으며 관리자는 즉시 회원탈퇴를 처리합니다. 단, 탈퇴의 요청은 인터넷 또는 서면으로 하여야 하며, 요청하는 자의 이름, 주민등록번호, 아이디, 비밀번호, 전화번호, 해지사유 등을 기재하여야 합니다.

제8조 (회원에 대한 통지)
① 회원이 제공한 전자우편 주소 또는 전화번호로 할 수 있습니다.

② 회원에 대한 통지의 경우 게시판에 게시함으로써 개별통지에 갈음할 수 있습니다.

제3장 이용자의 의무
제9조(이용자의 의무)
① 이용자는 서비스를 이용할 때 다음의 행위를 하지 않아야 합니다.

1. 신청 또는 변경 시 허위내용의 등록
2. 다른 회원의 주민등록번호 및 비밀번호를 부정하게 사용하는 행위
3. 홈페이지에 게시된 정보의 변경
4. 서비스를 이용하여 얻은 정보를 회원의 개인적인 이용 외에 복사, 번역, 2차적 저작 등을 통하여 복제, 공연, 방송, 전시, 배포, 출판 등에 사용하거나 제3자에게 제공하는 행위
5. 병원의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 행위
6. 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스 감염자료를 등록 또는 유포하는 행위
7. 서비스의 안정적 운영을 방해할 수 있는 정보를 전송하거나 수신자의 의사에 반하여 광고성 정보를 전송하는 행위
8. 다른 이용자에 대한 건강진료 및 상담을 하거나 알선하는 행위
9. 기타 관계법령에 위배되는 행위

② 전항 각호의 정보 또는 기타 병원이 사이트 운영상 부적절하다고 판단한 정보가 홈페이지에 게시되거나 사이트와 링크된 곳에 게시된 경우,병원은 이용자 또는 기타 정보의 게시를 행한 자의 승낙없이 홈페이지에서 당해 정보를 삭제하거나 링크를 단절할 수 있습니다. 단, 병원은 이러한 정보의 삭제·링크의 절단 등을 할 의무를 지지 않습니다.


제10조(이용자의 ID 및 비밀번호에 대한 의무)
① 이용자는 본 홈페이지를 이용하는 경우 ID 및 비밀번호를 사용해야 합니다.

② ID와 비밀번호에 관한 모든 관리의 책임은 이용자에게 있습니다.

③ 이용자는 자신의 ID 및 비밀번호를 제3자가 이용하게 해서는 안됩니다.

④ 이용자의 ID 및 비밀번호의 관리의 부실로 인한 모든 책임은 이용자가 부담합니다.

⑤ 이용자는 ID 및 비밀번호를 도난당하거나 제3자가 사용되고 있음을 인지한 경우에는 바로 병원에 통보하고 병원의 안내가 있는 경우에는 그에 따라야 합니다.


제4장 기타
제11조(저작권의 귀속 및 이용제한)
① 본사이트는 작성한 저작물에 대한 저작권 기타 지적재산권은 본사이트에 귀속합니다.

② 이용자는 홈페이지를 이용함으로써 얻은 정보를 사전 승낙없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자가 이용하게 하여서는 안됩니다.


제12조(분쟁해결)
① 본 이용약관에 규정된 것을 제외하고 발생하는 서비스이용에 관한 제반 문제에 관한 분쟁은 최대한 쌍방합의에 의해 해결하도록 합니다.

② 이용자가 홈페이지 이용과 관련하여 불만이 있거나 의견을 제시하고자 하는 경우에는 전자우편으로 홈페이지에 대한 불만사항 또는 의견을 제출하면 됩니다.

③ 관리자는 이용자로부터 제출되는 불만사항 및 의견이 정당하다고 판단하는 경우 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.


제13조(재판권 및 준거법)
① 본사이트와 이용자간에 서비스 이용으로 발생한 분쟁에 관한 소송은 주소지 관할법원으로 합니다.

② 본사이트와 이용자간에 제기된 전자거래 소송에는 대한민국법을 적용합니다.</textarea>
					</div>
					<div class="input-group mb-3">
                        <div class="checkbox checkbox-primary checkbox-fill d-inline">
                            <input type="checkbox" name="required_ck1" id="required_ck1" />
                            <label for="required_ck1" class="cr"><spring:message code='login.agmRequired1' /></label>
                        </div>
                    </div>

					<div class="input-group mb-3">
						<textarea class="form-control" rows="7" readonly="readonly" style="resize:none;">개인정보취급지침
djz레퍼런스센터(이하 "센터")는 이용자가 서비스를 이용함과 동시에 이용자의 개인 정보가 보호받을 수 있도록 [정보통신망이용]등에 관한 법률상의 [개인정보보호 규정] 및 정보통신부가 제정한 [개인정보보호지침]에 의거 아래의 개인정보 보호정책을 준수합니다. 또한, 센터의 개인정보 보호정책은 통지없이 수시로 갱신될 수 있으며, 이용자는 언제든지 개인정보 보호정책 페이지를 이용하여 최신 버전의 개인정보 보호정책을 확인할 수 있습니다.


1. 개인정보 공개
센터는 이용자의 사전허가 없이는 이용자의 개인정보를 무단으로 공개하지 않습니다. 센터는 회원 개개인의 허락없이 결코 개인정보를 공유하지 않는 것을 원칙으로 삼고 있습니다. 다만, 이용자 본인이 허락한 경우나, 특정 서비스 사용을 위해 개인정보를 수집하거나 전송할 필요가 있을 때 이용자가 이것을 허락한 경우, 관계법에 의거, 적법한 절차에 의한 정부기관의 요구가 있을 경우는 예외로 합니다.

2. 개인정보 수집 항목 및 방법, 이용목적 ,보유 이용기간
센터는 아래와 같은 개인정보를 수집하고 있습니다.

ο 수집항목 :
이름, 성별, 로그인ID, 비밀번호,휴대전화번호, 이메일, 회사명, 부서명, 직책 및 직위, 회사전화번호, 접속 로그 및 IP

ο 개인정보 수집방법 : 홈페이지(회원가입)
센터가 개인정보를 수집하고 이용하는 목적은 다음과 같습니다. 센터는 가입신청시 사용자에게 서비스를 제공하기 위한 최소한 정보를 수집함을 알려드림니다.

ο 개인정보 보유 및 이용기간 :
별도의 탈퇴요청이 없는한 유지되는 것을 기본으로 합니다.

ο 동의를 거부할 권리 :
개인정보 수집를 거부할 권리가 있으며 이경우 해당 서비스 제공에 받으실 수 없거나 제약이 있음을 알려드립니다.



3. 개인정보 열람 및 수정 방법
본 서비스는 이용자 스스로 개인정보를 열람하고 수정할 수 있습니다. 사용자로 등록하셨다면 언제라도 정보수정 화면을 통해 본인의 정보를 열람 수정, 갱신할 수 있습니다.


4. 개인정보 보유 및 이용기간, 파기절차 및 방법
본 서비스의 회원으로서 센터가 제공하는 서비스를 받는 동안 이용자의 개인정보는 센터에서 계속 보유하며 서비스 제공을 위해 이용하게 됩니다. 이용자의 개인정보는 이용자가 가입해지를 요청한 경우나 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 센터의 개인정보 파기절차 및 방법은 다음과 같습니다.

ο 파기절차 : 이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 일정 기간 저장된 후 파기 됩니다. 동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로이용되지 않습니다.

ο 파기방법 : 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다. 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 완전히 삭제되며 어떠한 용도로도 열람 또는 이용할 수 없도록 처리됩니다.

5. 개인 ID/비밀번호 관리
본 서비스의 ID와 비밀번호에 대한 관리 책임은 본인에게 있습니다.
센터는 본 서비스 이용자 개인정보를 보호하기 위해 최선을 다하고 있습니다. 그러나, 이런 노력이외에도 이용자 개개인이 본인의 개인정보를 효과적으로 보호하기 위해서 자신의 회원ID와 비밀번호를 적절하게 관리해야 하고 여기에 대한 책임을 져야 합니다. 혹시라도 이용자 본인이 본인의 ID와 비밀번호를 유출하였다면, 이에 대해서 센터는 책임지지 않습니다. 또한, 센터는 어떠한 경우에도 전화나 e-mail 등을 통해 사용자의 비밀번호를 묻지 않습니다. 그러므로 해당 ID와 비밀번호는 절대 본인만이 사용하시고, 비밀번호를 자주 바꿔주시는 것이 좋습니다. 또한, 센터는 개인정보보호에 최선을 다하지만 사용자 개인의 실수나 기본적인 인터넷의 위험성 때문에 일어나는 일들에 대해 책임을 지지 않습니다.

센터는 본 서비스 이용자 여러분의 개인정보를 보호하기 위해 최선을 다해 서비스 개선에 노력하고 있습니다. 센터가 위의 이용자 개인정보 보호정책을 지키지 않거나 불충분하다고 판단되신다면, 홈페이지관리자에게 연락을 보내 주십시오. 지적하신 문제를 확인하여 즉시 시정할 수 있도록 최선을 다하겠습니다.</textarea>
					</div>
					<div class="input-group mb-3">
                        <div class="checkbox checkbox-primary checkbox-fill d-inline">
                            <input type="checkbox" name="required_ck2" id="required_ck2" />
                            <label for="required_ck2" class="cr"><spring:message code='login.agmRequired2' /></label>
                        </div>
                    </div>

					<button class="btn btn-primary shadow-2 mb-4" onclick="fn_getAgreement()"><spring:message code='login.agreementNext' /></button>
				</div>
			</div>
		</div>
	</div>

	<script>
		function fn_getAgreement(){

			if(!$("#required_ck1").is(":checked")){
				swal('<spring:message code="login.agmRequiredMsg1" />');

				return;
			}

			if(!$("#required_ck2").is(":checked")){
				swal('<spring:message code="login.agmRequiredMsg2" />');

				return;
			}

			$.ajax({
				type : "POST",
				url : "/getAgreement.do",
				data : {"reqCk1":$("#required_ck1").is(":checked") ? "Y" : "N", "reqCk2":$("#required_ck2").is(":checked") ? "Y" : "N"},
				dataType : 'json',
				success : function(res) {
					/* ■ 상태코드
					 * 700 : 정상
			    	 * 701 : param의 값이 없음. 비정상 접근
			    	 * 706 : 인터넷 이용약관에 동의함 체크 안됨(비정상 접근)
			    	 * 707 : 개인정보 취급지침에 동의함 체크 안됨(비정상 접근)
			    	 */
					if(res.statusCode == 700){
						fn_createFormSubmit("/joinMembership.do", "post","","authKey",res.data.authKey,1);
					}else if(res.statusCode == 701){
						swal('<spring:message code="login.errMsg12" />');
					}else if(res.statusCode == 706){
						swal('<spring:message code="login.agmRequiredMsg1" />');
					}else if(res.statusCode == 707){
						swal('<spring:message code="login.agmRequiredMsg2" />');
					}
				},
				error : function(request, status, error) {
					alert("status: " + request.status + ", error: " + error);
				}
			});
		}
	</script>
</body>
</html>